[CerberusSectopod X2CharacterTemplate]
strCharacterName="Banshee"

[CorpseCerberusSectopod X2ItemTemplate]
FriendlyName="Banshee Corpse"
FriendlyNamePlural="Banshee Corpses"
BriefSummary="Banshees are synthetic-organic creatures derived from asari and mutated by Reaper technology. Frighteningly intelligent, Banshees are advanced pressure units usually found leading a Reaper strike force."

[RM_BansheeBioticBarrier X2AbilityTemplate]
LocFriendlyName="Biotic Barrier"
LocLongDescription="Banshees are vested with biotic engergy. They are capable of harnessing a dark energy field that can protect them from damage, and regenerate even when it's destroyed."
LocHelpText="Banshees have <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn."
LocFlyOverText="Biotic Barrier"
LocPromotionPopupText="<Bullet/>Biotics start with <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn.<br/>"

[RM_BansheeBioticRebuild X2AbilityTemplate]
LocFriendlyName="Biotic Barrier"
LocLongDescription="Banshees are vested with biotic engergy. They are capable of harnessing a dark energy field that can protect them from damage, and regenerate even when it's destroyed."
LocHelpText="Banshees have <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn."
LocFlyOverText="Biotic Barrier"

[RM_BansheeBioticRegen X2AbilityTemplate]
LocFriendlyName="Biotic Regeneration"
LocLongDescription="Banshees are vested with biotic engergy. They are capable of harnessing a dark energy field that can protect them from damage, and regenerate even when it's destroyed."
LocHelpText="Banshees have <Ability:BIOTIC_BARRIER/> point strong barriers, and can regain <Ability:BIOTICREGEN/> point(s) per turn. Regeneration can go faster with a high enough psi offence score."
LocFlyOverText="Biotic Regen"

[BansheeSlash X2AbilityTemplate]
LocFriendlyName="Rending Claws"
LocLongDescription="The Banshee's grotesque claws can strike and rend enemies from several meters away."
LocHelpText="Close-range swipe at a target that causes bleeding"
LocFlyOverText="Rending Claws"